package com.example.myapplication

import android.os.Bundle
import androidx.fragment.app.Fragment
import android.view.LayoutInflater
import android.view.View
import android.view.ViewGroup
import android.widget.Button
import androidx.navigation.fragment.findNavController
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView


class WignebisFragment : Fragment() {
    private lateinit var recyclerview:RecyclerView
    private lateinit var BookAdapter:BookAdapter
    private lateinit var booklist:ArrayList<Books>
    override fun onCreateView(
        inflater: LayoutInflater, container: ViewGroup?,
        savedInstanceState: Bundle?
    ): View? {
        // Inflate the layout for this fragment
        val view= inflater.inflate(R.layout.fragment_wignebis, container, false)
        recyclerview=view.findViewById(R.id.recycle)
        recyclerview.setHasFixedSize(true)
        recyclerview.layoutManager=LinearLayoutManager(this.requireContext())
        booklist=ArrayList()


        booklist.add(Books(R.drawable.metro2023,"Metro2033", "მეტრო 2033“ (რუს. Метро́ 2033) — რუსი მწერლის, დიმიტრი გლუხოვსკის პოსტაპოკალიფსური რომანი, გამოცემული 2005 წელს. მასში აღწერილია მოსკოვის მეტროში ადამიანების სიცოცხლე ბირთვული ომის შემდეგ.","ფასი:18₾"))
        booklist.add(Books(R.drawable.hitleri,"ჩემი ბრძოლა","„ჩემი ბრძოლა“ (გერმ. Mein Kampf) — ადოლფ ჰიტლერის ავტობიოგრაფიული ნაშრომი, რომელიც მან 1925-1926 წლებში გამოსცა.","ფასი:20₾"))
        booklist.add(Books(R.drawable.snowman,"თოვლის კაცი","პირველი თოვლი ჯადოსნურია - ხმებს ახშობს და კვალს შლის...\n" +
                "ნორვეგიის დედაქალაქ ოსლოში პირველი თოვლისგან გაკეთებულ თოვლის კაცს სიკვდილი მოაქვს...","ფასი:22₾"))
        booklist.add(Books(R.drawable.nigbisaxsareba,"ნიღბის აღსარება","ნიღბის აღსარება (იაპონ. 仮面の告白) — იაპონელი ავტორის, იუკიო მიშიმას რიგით მეორე რომანი, რომელიც პირველად 1949 წელს, გამომცემლობა კავადე შობოს მიერ გამოქვეყნდა.","ფასი:22₾"))
        booklist.add(Books(R.drawable.danashauli,"დანაშაული და სასჯელი","სიუჟეტი ვითარდება მთავარი გმირის როდიონ რასკოლნიკოვის ირგვლივ, რომლის გონებაშიც მწიფდება დანაშაულის თეორია.","ფასი:14₾"))
        booklist.add(Books(R.drawable.gtafimonte,"გრაფი მონტე კრისტო","გრაფი მონტე-კრისტო (ფრანგ. Le Comte de Monte-Cristo) — ალექსანდრ დიუმას სათავგადასავლო რომანი, რომელიც გამოიცა 1844-1846 წლებში.","ფასი:28₾"))
        booklist.add(Books(R.drawable.vefxistyaos1,"ვეფხისტყაოსანი","ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან.","ფასი:30₾"))

        booklist.add(Books(R.drawable.metro2023,"Metro2033", "მეტრო 2033“ (რუს. Метро́ 2033) — რუსი მწერლის, დიმიტრი გლუხოვსკის პოსტაპოკალიფსური რომანი, გამოცემული 2005 წელს. მასში აღწერილია მოსკოვის მეტროში ადამიანების სიცოცხლე ბირთვული ომის შემდეგ.","ფასი:18₾"))
        booklist.add(Books(R.drawable.hitleri,"ჩემი ბრძოლა","„ჩემი ბრძოლა“ (გერმ. Mein Kampf) — ადოლფ ჰიტლერის ავტობიოგრაფიული ნაშრომი, რომელიც მან 1925-1926 წლებში გამოსცა.","ფასი:20₾"))
        booklist.add(Books(R.drawable.snowman,"თოვლის კაცი","პირველი თოვლი ჯადოსნურია - ხმებს ახშობს და კვალს შლის...\n" +
                "ნორვეგიის დედაქალაქ ოსლოში პირველი თოვლისგან გაკეთებულ თოვლის კაცს სიკვდილი მოაქვს...","ფასი:22₾"))
        booklist.add(Books(R.drawable.nigbisaxsareba,"ნიღბის აღსარება","ნიღბის აღსარება (იაპონ. 仮面の告白) — იაპონელი ავტორის, იუკიო მიშიმას რიგით მეორე რომანი, რომელიც პირველად 1949 წელს, გამომცემლობა კავადე შობოს მიერ გამოქვეყნდა.","ფასი:22₾"))
        booklist.add(Books(R.drawable.danashauli,"დანაშაული და სასჯელი","სიუჟეტი ვითარდება მთავარი გმირის როდიონ რასკოლნიკოვის ირგვლივ, რომლის გონებაშიც მწიფდება დანაშაულის თეორია.","ფასი:14₾"))
        booklist.add(Books(R.drawable.gtafimonte,"გრაფი მონტე კრისტო","გრაფი მონტე-კრისტო (ფრანგ. Le Comte de Monte-Cristo) — ალექსანდრ დიუმას სათავგადასავლო რომანი, რომელიც გამოიცა 1844-1846 წლებში.","ფასი:28₾"))
        booklist.add(Books(R.drawable.vefxistyaos1,"ვეფხისტყაოსანი","ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან.","ფასი:30₾"))

        booklist.add(Books(R.drawable.metro2023,"Metro2033", "მეტრო 2033“ (რუს. Метро́ 2033) — რუსი მწერლის, დიმიტრი გლუხოვსკის პოსტაპოკალიფსური რომანი, გამოცემული 2005 წელს. მასში აღწერილია მოსკოვის მეტროში ადამიანების სიცოცხლე ბირთვული ომის შემდეგ.","ფასი:18₾"))
        booklist.add(Books(R.drawable.hitleri,"ჩემი ბრძოლა","„ჩემი ბრძოლა“ (გერმ. Mein Kampf) — ადოლფ ჰიტლერის ავტობიოგრაფიული ნაშრომი, რომელიც მან 1925-1926 წლებში გამოსცა.","ფასი:20₾"))
        booklist.add(Books(R.drawable.snowman,"თოვლის კაცი","პირველი თოვლი ჯადოსნურია - ხმებს ახშობს და კვალს შლის...\n" +
                "ნორვეგიის დედაქალაქ ოსლოში პირველი თოვლისგან გაკეთებულ თოვლის კაცს სიკვდილი მოაქვს...","ფასი:22₾"))
        booklist.add(Books(R.drawable.nigbisaxsareba,"ნიღბის აღსარება","ნიღბის აღსარება (იაპონ. 仮面の告白) — იაპონელი ავტორის, იუკიო მიშიმას რიგით მეორე რომანი, რომელიც პირველად 1949 წელს, გამომცემლობა კავადე შობოს მიერ გამოქვეყნდა.","ფასი:22₾"))
        booklist.add(Books(R.drawable.danashauli,"დანაშაული და სასჯელი","სიუჟეტი ვითარდება მთავარი გმირის როდიონ რასკოლნიკოვის ირგვლივ, რომლის გონებაშიც მწიფდება დანაშაულის თეორია.","ფასი:14₾"))
        booklist.add(Books(R.drawable.gtafimonte,"გრაფი მონტე კრისტო","გრაფი მონტე-კრისტო (ფრანგ. Le Comte de Monte-Cristo) — ალექსანდრ დიუმას სათავგადასავლო რომანი, რომელიც გამოიცა 1844-1846 წლებში.","ფასი:28₾"))
        booklist.add(Books(R.drawable.vefxistyaos1,"ვეფხისტყაოსანი","ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან.","ფასი:30₾"))

        booklist.add(Books(R.drawable.metro2023,"Metro2033", "მეტრო 2033“ (რუს. Метро́ 2033) — რუსი მწერლის, დიმიტრი გლუხოვსკის პოსტაპოკალიფსური რომანი, გამოცემული 2005 წელს. მასში აღწერილია მოსკოვის მეტროში ადამიანების სიცოცხლე ბირთვული ომის შემდეგ.","ფასი:18₾"))
        booklist.add(Books(R.drawable.hitleri,"ჩემი ბრძოლა","„ჩემი ბრძოლა“ (გერმ. Mein Kampf) — ადოლფ ჰიტლერის ავტობიოგრაფიული ნაშრომი, რომელიც მან 1925-1926 წლებში გამოსცა.","ფასი:20₾"))
        booklist.add(Books(R.drawable.snowman,"თოვლის კაცი","პირველი თოვლი ჯადოსნურია - ხმებს ახშობს და კვალს შლის...\n" +
                "ნორვეგიის დედაქალაქ ოსლოში პირველი თოვლისგან გაკეთებულ თოვლის კაცს სიკვდილი მოაქვს...","ფასი:22₾"))
        booklist.add(Books(R.drawable.nigbisaxsareba,"ნიღბის აღსარება","ნიღბის აღსარება (იაპონ. 仮面の告白) — იაპონელი ავტორის, იუკიო მიშიმას რიგით მეორე რომანი, რომელიც პირველად 1949 წელს, გამომცემლობა კავადე შობოს მიერ გამოქვეყნდა.","ფასი:22₾"))
        booklist.add(Books(R.drawable.danashauli,"დანაშაული და სასჯელი","სიუჟეტი ვითარდება მთავარი გმირის როდიონ რასკოლნიკოვის ირგვლივ, რომლის გონებაშიც მწიფდება დანაშაულის თეორია.","ფასი:14₾"))
        booklist.add(Books(R.drawable.gtafimonte,"გრაფი მონტე კრისტო","გრაფი მონტე-კრისტო (ფრანგ. Le Comte de Monte-Cristo) — ალექსანდრ დიუმას სათავგადასავლო რომანი, რომელიც გამოიცა 1844-1846 წლებში.","ფასი:28₾"))
        booklist.add(Books(R.drawable.vefxistyaos1,"ვეფხისტყაოსანი","ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან.","ფასი:30₾"))

        booklist.add(Books(R.drawable.metro2023,"Metro2033", "მეტრო 2033“ (რუს. Метро́ 2033) — რუსი მწერლის, დიმიტრი გლუხოვსკის პოსტაპოკალიფსური რომანი, გამოცემული 2005 წელს. მასში აღწერილია მოსკოვის მეტროში ადამიანების სიცოცხლე ბირთვული ომის შემდეგ.","ფასი:18₾"))
        booklist.add(Books(R.drawable.hitleri,"ჩემი ბრძოლა","„ჩემი ბრძოლა“ (გერმ. Mein Kampf) — ადოლფ ჰიტლერის ავტობიოგრაფიული ნაშრომი, რომელიც მან 1925-1926 წლებში გამოსცა.","ფასი:20₾"))
        booklist.add(Books(R.drawable.snowman,"თოვლის კაცი","პირველი თოვლი ჯადოსნურია - ხმებს ახშობს და კვალს შლის...\n" +
                "ნორვეგიის დედაქალაქ ოსლოში პირველი თოვლისგან გაკეთებულ თოვლის კაცს სიკვდილი მოაქვს...","ფასი:22₾"))
        booklist.add(Books(R.drawable.nigbisaxsareba,"ნიღბის აღსარება","ნიღბის აღსარება (იაპონ. 仮面の告白) — იაპონელი ავტორის, იუკიო მიშიმას რიგით მეორე რომანი, რომელიც პირველად 1949 წელს, გამომცემლობა კავადე შობოს მიერ გამოქვეყნდა.","ფასი:22₾"))
        booklist.add(Books(R.drawable.danashauli,"დანაშაული და სასჯელი","სიუჟეტი ვითარდება მთავარი გმირის როდიონ რასკოლნიკოვის ირგვლივ, რომლის გონებაშიც მწიფდება დანაშაულის თეორია.","ფასი:14₾"))
        booklist.add(Books(R.drawable.gtafimonte,"გრაფი მონტე კრისტო","გრაფი მონტე-კრისტო (ფრანგ. Le Comte de Monte-Cristo) — ალექსანდრ დიუმას სათავგადასავლო რომანი, რომელიც გამოიცა 1844-1846 წლებში.","ფასი:28₾"))
        booklist.add(Books(R.drawable.vefxistyaos1,"ვეფხისტყაოსანი","ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან.","ფასი:30₾"))

        booklist.add(Books(R.drawable.metro2023,"Metro2033", "მეტრო 2033“ (რუს. Метро́ 2033) — რუსი მწერლის, დიმიტრი გლუხოვსკის პოსტაპოკალიფსური რომანი, გამოცემული 2005 წელს. მასში აღწერილია მოსკოვის მეტროში ადამიანების სიცოცხლე ბირთვული ომის შემდეგ.","ფასი:18₾"))
        booklist.add(Books(R.drawable.hitleri,"ჩემი ბრძოლა","„ჩემი ბრძოლა“ (გერმ. Mein Kampf) — ადოლფ ჰიტლერის ავტობიოგრაფიული ნაშრომი, რომელიც მან 1925-1926 წლებში გამოსცა.","ფასი:20₾"))
        booklist.add(Books(R.drawable.snowman,"თოვლის კაცი","პირველი თოვლი ჯადოსნურია - ხმებს ახშობს და კვალს შლის...\n" +
                "ნორვეგიის დედაქალაქ ოსლოში პირველი თოვლისგან გაკეთებულ თოვლის კაცს სიკვდილი მოაქვს...","ფასი:22₾"))
        booklist.add(Books(R.drawable.nigbisaxsareba,"ნიღბის აღსარება","ნიღბის აღსარება (იაპონ. 仮面の告白) — იაპონელი ავტორის, იუკიო მიშიმას რიგით მეორე რომანი, რომელიც პირველად 1949 წელს, გამომცემლობა კავადე შობოს მიერ გამოქვეყნდა.","ფასი:22₾"))
        booklist.add(Books(R.drawable.danashauli,"დანაშაული და სასჯელი","სიუჟეტი ვითარდება მთავარი გმირის როდიონ რასკოლნიკოვის ირგვლივ, რომლის გონებაშიც მწიფდება დანაშაულის თეორია.","ფასი:14₾"))
        booklist.add(Books(R.drawable.gtafimonte,"გრაფი მონტე კრისტო","გრაფი მონტე-კრისტო (ფრანგ. Le Comte de Monte-Cristo) — ალექსანდრ დიუმას სათავგადასავლო რომანი, რომელიც გამოიცა 1844-1846 წლებში.","ფასი:28₾"))
        booklist.add(Books(R.drawable.vefxistyaos1,"ვეფხისტყაოსანი","ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან.","ფასი:30₾"))

        booklist.add(Books(R.drawable.metro2023,"Metro2033", "მეტრო 2033“ (რუს. Метро́ 2033) — რუსი მწერლის, დიმიტრი გლუხოვსკის პოსტაპოკალიფსური რომანი, გამოცემული 2005 წელს. მასში აღწერილია მოსკოვის მეტროში ადამიანების სიცოცხლე ბირთვული ომის შემდეგ.","ფასი:18₾"))
        booklist.add(Books(R.drawable.hitleri,"ჩემი ბრძოლა","„ჩემი ბრძოლა“ (გერმ. Mein Kampf) — ადოლფ ჰიტლერის ავტობიოგრაფიული ნაშრომი, რომელიც მან 1925-1926 წლებში გამოსცა.","ფასი:20₾"))
        booklist.add(Books(R.drawable.snowman,"თოვლის კაცი","პირველი თოვლი ჯადოსნურია - ხმებს ახშობს და კვალს შლის...\n" +
                "ნორვეგიის დედაქალაქ ოსლოში პირველი თოვლისგან გაკეთებულ თოვლის კაცს სიკვდილი მოაქვს...","ფასი:22₾"))
        booklist.add(Books(R.drawable.nigbisaxsareba,"ნიღბის აღსარება","ნიღბის აღსარება (იაპონ. 仮面の告白) — იაპონელი ავტორის, იუკიო მიშიმას რიგით მეორე რომანი, რომელიც პირველად 1949 წელს, გამომცემლობა კავადე შობოს მიერ გამოქვეყნდა.","ფასი:22₾"))
        booklist.add(Books(R.drawable.danashauli,"დანაშაული და სასჯელი","სიუჟეტი ვითარდება მთავარი გმირის როდიონ რასკოლნიკოვის ირგვლივ, რომლის გონებაშიც მწიფდება დანაშაულის თეორია.","ფასი:14₾"))
        booklist.add(Books(R.drawable.gtafimonte,"გრაფი მონტე კრისტო","გრაფი მონტე-კრისტო (ფრანგ. Le Comte de Monte-Cristo) — ალექსანდრ დიუმას სათავგადასავლო რომანი, რომელიც გამოიცა 1844-1846 წლებში.","ფასი:28₾"))
        booklist.add(Books(R.drawable.vefxistyaos1,"ვეფხისტყაოსანი","ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან.","ფასი:30₾"))

        booklist.add(Books(R.drawable.metro2023,"Metro2033", "მეტრო 2033“ (რუს. Метро́ 2033) — რუსი მწერლის, დიმიტრი გლუხოვსკის პოსტაპოკალიფსური რომანი, გამოცემული 2005 წელს. მასში აღწერილია მოსკოვის მეტროში ადამიანების სიცოცხლე ბირთვული ომის შემდეგ.","ფასი:18₾"))
        booklist.add(Books(R.drawable.hitleri,"ჩემი ბრძოლა","„ჩემი ბრძოლა“ (გერმ. Mein Kampf) — ადოლფ ჰიტლერის ავტობიოგრაფიული ნაშრომი, რომელიც მან 1925-1926 წლებში გამოსცა.","ფასი:20₾"))
        booklist.add(Books(R.drawable.snowman,"თოვლის კაცი","პირველი თოვლი ჯადოსნურია - ხმებს ახშობს და კვალს შლის...\n" +
                "ნორვეგიის დედაქალაქ ოსლოში პირველი თოვლისგან გაკეთებულ თოვლის კაცს სიკვდილი მოაქვს...","ფასი:22₾"))
        booklist.add(Books(R.drawable.nigbisaxsareba,"ნიღბის აღსარება","ნიღბის აღსარება (იაპონ. 仮面の告白) — იაპონელი ავტორის, იუკიო მიშიმას რიგით მეორე რომანი, რომელიც პირველად 1949 წელს, გამომცემლობა კავადე შობოს მიერ გამოქვეყნდა.","ფასი:22₾"))
        booklist.add(Books(R.drawable.danashauli,"დანაშაული და სასჯელი","სიუჟეტი ვითარდება მთავარი გმირის როდიონ რასკოლნიკოვის ირგვლივ, რომლის გონებაშიც მწიფდება დანაშაულის თეორია.","ფასი:14₾"))
        booklist.add(Books(R.drawable.gtafimonte,"გრაფი მონტე კრისტო","გრაფი მონტე-კრისტო (ფრანგ. Le Comte de Monte-Cristo) — ალექსანდრ დიუმას სათავგადასავლო რომანი, რომელიც გამოიცა 1844-1846 წლებში.","ფასი:28₾"))
        booklist.add(Books(R.drawable.vefxistyaos1,"ვეფხისტყაოსანი","ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან.","ფასი:30₾"))

        booklist.add(Books(R.drawable.metro2023,"Metro2033", "მეტრო 2033“ (რუს. Метро́ 2033) — რუსი მწერლის, დიმიტრი გლუხოვსკის პოსტაპოკალიფსური რომანი, გამოცემული 2005 წელს. მასში აღწერილია მოსკოვის მეტროში ადამიანების სიცოცხლე ბირთვული ომის შემდეგ.","ფასი:18₾"))
        booklist.add(Books(R.drawable.hitleri,"ჩემი ბრძოლა","„ჩემი ბრძოლა“ (გერმ. Mein Kampf) — ადოლფ ჰიტლერის ავტობიოგრაფიული ნაშრომი, რომელიც მან 1925-1926 წლებში გამოსცა.","ფასი:20₾"))
        booklist.add(Books(R.drawable.snowman,"თოვლის კაცი","პირველი თოვლი ჯადოსნურია - ხმებს ახშობს და კვალს შლის...\n" +
                "ნორვეგიის დედაქალაქ ოსლოში პირველი თოვლისგან გაკეთებულ თოვლის კაცს სიკვდილი მოაქვს...","ფასი:22₾"))
        booklist.add(Books(R.drawable.nigbisaxsareba,"ნიღბის აღსარება","ნიღბის აღსარება (იაპონ. 仮面の告白) — იაპონელი ავტორის, იუკიო მიშიმას რიგით მეორე რომანი, რომელიც პირველად 1949 წელს, გამომცემლობა კავადე შობოს მიერ გამოქვეყნდა.","ფასი:22₾"))
        booklist.add(Books(R.drawable.danashauli,"დანაშაული და სასჯელი","სიუჟეტი ვითარდება მთავარი გმირის როდიონ რასკოლნიკოვის ირგვლივ, რომლის გონებაშიც მწიფდება დანაშაულის თეორია.","ფასი:14₾"))
        booklist.add(Books(R.drawable.gtafimonte,"გრაფი მონტე კრისტო","გრაფი მონტე-კრისტო (ფრანგ. Le Comte de Monte-Cristo) — ალექსანდრ დიუმას სათავგადასავლო რომანი, რომელიც გამოიცა 1844-1846 წლებში.","ფასი:28₾"))
        booklist.add(Books(R.drawable.vefxistyaos1,"ვეფხისტყაოსანი","ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან.","ფასი:30₾"))

        booklist.add(Books(R.drawable.metro2023,"Metro2033", "მეტრო 2033“ (რუს. Метро́ 2033) — რუსი მწერლის, დიმიტრი გლუხოვსკის პოსტაპოკალიფსური რომანი, გამოცემული 2005 წელს. მასში აღწერილია მოსკოვის მეტროში ადამიანების სიცოცხლე ბირთვული ომის შემდეგ.","ფასი:18₾"))
        booklist.add(Books(R.drawable.hitleri,"ჩემი ბრძოლა","„ჩემი ბრძოლა“ (გერმ. Mein Kampf) — ადოლფ ჰიტლერის ავტობიოგრაფიული ნაშრომი, რომელიც მან 1925-1926 წლებში გამოსცა.","ფასი:20₾"))
        booklist.add(Books(R.drawable.snowman,"თოვლის კაცი","პირველი თოვლი ჯადოსნურია - ხმებს ახშობს და კვალს შლის...\n" +
                "ნორვეგიის დედაქალაქ ოსლოში პირველი თოვლისგან გაკეთებულ თოვლის კაცს სიკვდილი მოაქვს...","ფასი:22₾"))
        booklist.add(Books(R.drawable.nigbisaxsareba,"ნიღბის აღსარება","ნიღბის აღსარება (იაპონ. 仮面の告白) — იაპონელი ავტორის, იუკიო მიშიმას რიგით მეორე რომანი, რომელიც პირველად 1949 წელს, გამომცემლობა კავადე შობოს მიერ გამოქვეყნდა.","ფასი:22₾"))
        booklist.add(Books(R.drawable.danashauli,"დანაშაული და სასჯელი","სიუჟეტი ვითარდება მთავარი გმირის როდიონ რასკოლნიკოვის ირგვლივ, რომლის გონებაშიც მწიფდება დანაშაულის თეორია.","ფასი:14₾"))
        booklist.add(Books(R.drawable.gtafimonte,"გრაფი მონტე კრისტო","გრაფი მონტე-კრისტო (ფრანგ. Le Comte de Monte-Cristo) — ალექსანდრ დიუმას სათავგადასავლო რომანი, რომელიც გამოიცა 1844-1846 წლებში.","ფასი:28₾"))
        booklist.add(Books(R.drawable.vefxistyaos1,"ვეფხისტყაოსანი","ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან.","ფასი:30₾"))

        booklist.add(Books(R.drawable.metro2023,"Metro2033", "მეტრო 2033“ (რუს. Метро́ 2033) — რუსი მწერლის, დიმიტრი გლუხოვსკის პოსტაპოკალიფსური რომანი, გამოცემული 2005 წელს. მასში აღწერილია მოსკოვის მეტროში ადამიანების სიცოცხლე ბირთვული ომის შემდეგ.","ფასი:18₾"))
        booklist.add(Books(R.drawable.hitleri,"ჩემი ბრძოლა","„ჩემი ბრძოლა“ (გერმ. Mein Kampf) — ადოლფ ჰიტლერის ავტობიოგრაფიული ნაშრომი, რომელიც მან 1925-1926 წლებში გამოსცა.","ფასი:20₾"))
        booklist.add(Books(R.drawable.snowman,"თოვლის კაცი","პირველი თოვლი ჯადოსნურია - ხმებს ახშობს და კვალს შლის...\n" +
                "ნორვეგიის დედაქალაქ ოსლოში პირველი თოვლისგან გაკეთებულ თოვლის კაცს სიკვდილი მოაქვს...","ფასი:22₾"))
        booklist.add(Books(R.drawable.nigbisaxsareba,"ნიღბის აღსარება","ნიღბის აღსარება (იაპონ. 仮面の告白) — იაპონელი ავტორის, იუკიო მიშიმას რიგით მეორე რომანი, რომელიც პირველად 1949 წელს, გამომცემლობა კავადე შობოს მიერ გამოქვეყნდა.","ფასი:22₾"))
        booklist.add(Books(R.drawable.danashauli,"დანაშაული და სასჯელი","სიუჟეტი ვითარდება მთავარი გმირის როდიონ რასკოლნიკოვის ირგვლივ, რომლის გონებაშიც მწიფდება დანაშაულის თეორია.","ფასი:14₾"))
        booklist.add(Books(R.drawable.gtafimonte,"გრაფი მონტე კრისტო","გრაფი მონტე-კრისტო (ფრანგ. Le Comte de Monte-Cristo) — ალექსანდრ დიუმას სათავგადასავლო რომანი, რომელიც გამოიცა 1844-1846 წლებში.","ფასი:28₾"))
        booklist.add(Books(R.drawable.vefxistyaos1,"ვეფხისტყაოსანი","ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან.","ფასი:30₾"))

        booklist.add(Books(R.drawable.metro2023,"Metro2033", "მეტრო 2033“ (რუს. Метро́ 2033) — რუსი მწერლის, დიმიტრი გლუხოვსკის პოსტაპოკალიფსური რომანი, გამოცემული 2005 წელს. მასში აღწერილია მოსკოვის მეტროში ადამიანების სიცოცხლე ბირთვული ომის შემდეგ.","ფასი:18₾"))
        booklist.add(Books(R.drawable.hitleri,"ჩემი ბრძოლა","„ჩემი ბრძოლა“ (გერმ. Mein Kampf) — ადოლფ ჰიტლერის ავტობიოგრაფიული ნაშრომი, რომელიც მან 1925-1926 წლებში გამოსცა.","ფასი:20₾"))
        booklist.add(Books(R.drawable.snowman,"თოვლის კაცი","პირველი თოვლი ჯადოსნურია - ხმებს ახშობს და კვალს შლის...\n" +
                "ნორვეგიის დედაქალაქ ოსლოში პირველი თოვლისგან გაკეთებულ თოვლის კაცს სიკვდილი მოაქვს...","ფასი:22₾"))
        booklist.add(Books(R.drawable.nigbisaxsareba,"ნიღბის აღსარება","ნიღბის აღსარება (იაპონ. 仮面の告白) — იაპონელი ავტორის, იუკიო მიშიმას რიგით მეორე რომანი, რომელიც პირველად 1949 წელს, გამომცემლობა კავადე შობოს მიერ გამოქვეყნდა.","ფასი:22₾"))
        booklist.add(Books(R.drawable.danashauli,"დანაშაული და სასჯელი","სიუჟეტი ვითარდება მთავარი გმირის როდიონ რასკოლნიკოვის ირგვლივ, რომლის გონებაშიც მწიფდება დანაშაულის თეორია.","ფასი:14₾"))
        booklist.add(Books(R.drawable.gtafimonte,"გრაფი მონტე კრისტო","გრაფი მონტე-კრისტო (ფრანგ. Le Comte de Monte-Cristo) — ალექსანდრ დიუმას სათავგადასავლო რომანი, რომელიც გამოიცა 1844-1846 წლებში.","ფასი:28₾"))
        booklist.add(Books(R.drawable.vefxistyaos1,"ვეფხისტყაოსანი","ვეფხისტყაოსანი — XII საუკუნის ქართველი პოეტის, შოთა რუსთაველის ჩვენამდე მოღწეული ერთადერთი პოემა. შედგება პროლოგის, ძირითადი ნაწილისა და ეპილოგისაგან.","ფასი:30₾"))





        BookAdapter=BookAdapter(booklist)
        recyclerview.adapter=BookAdapter



        return view


    }


}